---
title: EnergyAnalysisSpace
classe: Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# EnergyAnalysisSpace

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Area { get; }` | `energyAnalysisSpace.Area` | Double |
| `String CADObjectUniqueId { get; }` | `energyAnalysisSpace.CADObjectUniqueId` | String |
| `String ComposedName { get; }` | `energyAnalysisSpace.ComposedName` | String |
| `String Description { get; }` | `energyAnalysisSpace.Description` | String |
| `String Number { get; }` | `energyAnalysisSpace.Number` | String |
| `String SpaceName { get; }` | `energyAnalysisSpace.SpaceName` | String |
| `Double Volume { get; }` | `energyAnalysisSpace.Volume` | Double |
| `IList<EnergyAnalysisSurface> GetAnalyticalSurfaces()` | `energyAnalysisSpace.GetAnalyticalSurfaces()` | IList<EnergyAnalysisSurface> |
| `IList<Polyloop> GetBoundary()` | `energyAnalysisSpace.GetBoundary()` | IList<Polyloop> |
| `IList<Polyloop> GetClosedShell()` | `energyAnalysisSpace.GetClosedShell()` | IList<Polyloop> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```